perftest.yml
config:
  target: 'https://omsproxy-dev.lllapi.vision'
  environments:
    stage:
      target: 'https://omsproxy-stage.lllapi.vision'
    qa:
      target: 'https://omsproxy-qa.lllapi.vision'
    dev:
      target: 'https://omsproxy-dev.lllapi.vision'
  plugins:
    aws-sigv4:
      serviceName: 'execute-api'
  phases:
    - duration: 10
      arrivalRate: 2
  defaults:
    headers:
      Content-type: 'application/json'
scenarios:
  - name: '/availableproducts'
    beforeRequest: 'addAmazonSignatureV4'
    weight: 90000
    flow:
    - post:
        url: '/availableproducts'
        body: |
          {"Country":"US","InsideBopisFence":"Y","Node":[{"NodeID":"23013","SKU":[{"SKUID":"21282","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21283","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21284","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21285","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21286","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21287","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21288","InventoryOrganizationCode":"LULU_ECOMM"}]},{"NodeID":"24013","SKU":[{"SKUID":"21282","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21283","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21284","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21285","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21286","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21287","InventoryOrganizationCode":"LULU_ECOMM"},{"SKUID":"21288","InventoryOrganizationCode":"LULU_ECOMM"}]}]}
  - name: '/cancelorder'
    beforeRequest: 'addAmazonSignatureV4'
    weight: 600
    flow:
    - post:
        url: '/cancelorder'
        body: |
          {"OrderNo":"20180617001","EnterpriseCode":"LULULEMON_US_ECOMM","DocumentType":"0001","CancellationReason":"GUEST_CANCEL"}
  - name: '/productavailability'
    beforeRequest: 'addAmazonSignatureV4'
    weight: 72868
    flow:
    - post:
        url: '/productavailability'
        body: |
          {"SKU":[{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"4"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"7"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"2"}],"SKUID":"3742345"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"7"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"4"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"5"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"6"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"6"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"5"}],"SKUID":"3690475"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"5"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"3"}],"SKUID":"3728401"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"10"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"4"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"62"}],"SKUID":"3727767"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"9"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"4"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"5"}],"SKUID":"3691069"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"5"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"1"}],"SKUID":"3727763"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"4"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"62"}],"SKUID":"3751856"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"7"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"4"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"2"}],"SKUID":"3754215"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"4"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"62"}],"SKUID":"3726741"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"5"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"7"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"5"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"6"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"6"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"4"}],"SKUID":"3752437"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"1"}],"SKUID":"3772443"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"2"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"3"}],"SKUID":"3761535"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"2"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"2"}],"SKUID":"3765265"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"0"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"1"}],"SKUID":"3764173"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"7"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"2"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"0"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"2"}],"SKUID":"3752220"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"2"}],"SKUID":"3757975"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"2"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"2"}],"SKUID":"3760218"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"1"}],"SKUID":"3691350"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"2"}],"SKUID":"3736586"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"3"}],"SKUID":"3737791"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"2"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"4"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"3"}],"SKUID":"3690805"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"2"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"1"}],"SKUID":"3726235"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"3"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"2"}],"SKUID":"3752248"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"1"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"2"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"2"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"4"}],"SKUID":"3715935"},{"InventoryOrganizationCode":"LULU_ECOMM","Node":[{"NodeID":"15016","BOPISAvailability":"0","Availability":"62"},{"NodeID":"15015","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12010","BOPISAvailability":"0","Availability":"2"},{"NodeID":"12011","BOPISAvailability":"0","Availability":"2"},{"NodeID":"12013","BOPISAvailability":"0","Availability":"3"},{"NodeID":"10617","BOPISAvailability":"0","Availability":"4"},{"NodeID":"10616","BOPISAvailability":"0","Availability":"95"},{"NodeID":"12015","BOPISAvailability":"0","Availability":"1"},{"NodeID":"10619","BOPISAvailability":"0","Availability":"62"},{"NodeID":"12014","BOPISAvailability":"0","Availability":"2"}],"SKUID":"3772143"}],"Country":"US","InsideBopisFence":"Y"}
  - name: '/reserveinventory'
    beforeRequest: 'addAmazonSignatureV4'
    weight: 2594
    flow:
    - post:
        url: '/reserveinventory'
        body: |
          {"OrganizationCode":"LULULEMON_US_ECOMM","AllocationRuleID":"","ReservationParameters":{"AllowPartialReservation":"N","ReservationID":"R201876505181weew0","ExpirationDate":"2014-09-23T16:34:35.121-07:00"},"PromiseLines":{"PromiseLine":[{"ShipToAddress":{"AddressLine1":"130BatterySt","AddressLine2":"","AddressLine3":"","City":"SanFrancisco","State":"CA","Country":"US","ZipCode":"94111"},"CarrierServiceCode":"","DeliveryMethod":"SHP","FillQuantity":"1","ItemID":"21281","LineId":"1","RequiredQty":"1","UnitOfMeasure":"EACH"}]}}